; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	thermograph2 - mode
	thermograph5 - mode
	spectrograph4 - mode
	spectrograph1 - mode
	image3 - mode
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(supports instrument1 thermograph2)
	(supports instrument1 image3)
	(supports instrument1 thermograph5)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph5)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument4 thermograph5)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 Star5)
	(pointing satellite3 Star3)
	(have_image Star6 thermograph5)
	(have_image Planet7 spectrograph1)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 infrared0)
	(have_image Star9 spectrograph1)
	(have_image Planet10 image3)
	(have_image Star11 thermograph2)
	(have_image Star11 image3)
))

)

; plan
1. (turn_to satellite3 groundstation4 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation4)
   goals met: 1 of 11
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 11
3. (calibrate satellite3 instrument5 groundstation4)
   added: (calibrated instrument5)
   goals met: 1 of 11
4. (turn_to satellite3 star9 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star9)
   goals met: 1 of 11
5. (take_image satellite3 star9 instrument5 infrared0)
   added: (have_image star9 infrared0)
   goals met: 2 of 11
6. (turn_to satellite3 phenomenon8 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 11
7. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 2 of 11
8. (take_image satellite3 phenomenon8 instrument5 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 3 of 11
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 11
10. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 3 of 11
11. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 3 of 11
12. (take_image satellite1 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   goals met: 4 of 11
13. (turn_to satellite1 planet7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet7)
   goals met: 4 of 11
14. (take_image satellite1 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 5 of 11
15. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 5 of 11
16. (take_image satellite1 star11 instrument1 image3)
   added: (have_image star11 image3)
   goals met: 6 of 11
17. (take_image satellite1 star11 instrument1 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 7 of 11
18. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 7 of 11
19. (take_image satellite1 star6 instrument1 thermograph5)
   added: (have_image star6 thermograph5)
   goals met: 8 of 11
20. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 8 of 11
21. (take_image satellite1 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 9 of 11
22. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 10 of 11
23. (turn_to satellite3 star3 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star3)
   goals met: 11 of 11
